<?php

return [
    'backend' => [
        'users' => [
            'created'        => 'تم إنشاء المستخدم',
            'updated'        => 'تم تعديل المستخدم',
            'deleted'        => 'تم حذف المستخدم',
            'bulk_destroyed' => 'تم حذف المستخدمين المختارين',
            'bulk_enabled'   => 'تم تفعيل المستخدمين المختارين',
            'bulk_disabled'  => 'تم تعطيل المستخدمين المختارين',
        ],

        'roles' => [
            'created' => 'تم إنشاء الدور',
            'updated' => 'تم تعديل الدور',
            'deleted' => 'تم حذف الدور',
        ],

        'metas' => [
            'created'        => 'تم إنشاء البيانات الوصفية',
            'updated'        => 'تم تعديل البيانات الوصفية',
            'deleted'        => 'تم حذف البيانات الوصفية',
            'bulk_destroyed' => 'تم حذف البيانات الوصفية المختارة',
        ],

        'form_submissions' => [
            'deleted'        => 'تم حذف المرسَل',
            'bulk_destroyed' => 'تم حذف المرسَلات المختارة',
        ],

        'form_settings' => [
            'created' => 'تم إنشاء إعداد الإستمارة',
            'updated' => 'تم تعديل إعداد الإستمارة',
            'deleted' => 'تم حذف إعداد الإستمارة',
        ],

        'redirections' => [
            'created'        => 'تم إنشاء قاعدة التوجيه',
            'updated'        => 'تم تعديل قاعدة التوجيه',
            'deleted'        => 'تم حذف قاعدة التوجيه',
            'bulk_destroyed' => 'تم حذف قواعد التوجيه المختارة',
            'bulk_enabled'   => 'تم تفعيل قواعد التوجيه المختارة',
            'bulk_disabled'  => 'تم تعطيل قواعد التوجيه المختارة',
            'file_imported'  => 'تم إستيراد الملف بنجاح',
        ],

        'posts' => [
            'created'        => 'تم إنشاء المقالة',
            'updated'        => 'تم تعديل المقالة',
            'deleted'        => 'تم حذف المقالة',
            'bulk_destroyed' => 'تم حذف المقالات المختارة',
            'bulk_published' => 'تم نشر المقالات المختارة',
            'bulk_pending'   => 'المقالات المختارة قيد المراجعة',
            'bulk_pinned'    => 'تم تثبيت المقالات المختارة',
            'bulk_promoted'  => 'تم ترقية المقالات المختارة',
        ],

        'actions' => [
            'invalid' => 'إجراء غير صالح',
        ],
    ],

    'frontend' => [
    ],
];
