<?php

return [
    'general'      => 'خطأ في الخادم',
    'unauthorized' => 'إجراء غير مسموح',

    'backend' => [
        'users' => [
            'create'                            => 'خطأ في إنشاء المستخدم',
            'update'                            => 'خطأ في تعديل المستخدم',
            'delete'                            => 'خطأ في حذف المستخدم',
            'first_user_cannot_be_edited'       => 'لا يمكن تعديل معلومات المستخدم كامل الصلاحيات',
            'first_user_cannot_be_disabled'     => 'لا يمكن تعطيل حساب المستخدم كامل الصلاحيات',
            'first_user_cannot_be_destroyed'    => 'لا يمكن حذف حساب المستخدم كامل الصلاحيات',
            'first_user_cannot_be_impersonated' => 'لا يمكن إنتحال شخصية المستخدم كامل الصلاحيات',
            'cannot_set_superior_roles'         => 'لا يمكنك الحصول على أدوار تفوق الدور الخاص بك',
        ],

        'roles' => [
            'create' => 'خطأ في إنشاء الدور',
            'update' => 'خطأ في تعديل الدور',
            'delete' => 'خطأ في حذف الدور',
        ],

        'metas' => [
            'create'        => 'خطأ في إنشاء المعلومة الوصفية',
            'update'        => 'خطأ في تعديل المعلومة الوصفية',
            'delete'        => 'خطأ في حذف المعلومة الوصفية',
            'already_exist' => ' يوجد معلومات وصفية لهذا الرابط منشأ مسبقاً',
        ],

        'form_submissions' => [
            'create' => 'خطأ في إنشاء المرسَل',
            'delete' => 'خطأ في حذف المرسَل',
        ],

        'form_settings' => [
            'create'        => 'خطا في إنشاء إعداد الإستمارة',
            'update'        => 'خطا في تعديل إعداد الإستمارة',
            'delete'        => 'خطا في حذف إعداد الإستمارة',
            'already_exist' => 'يوجد إعداد مرتبط بهذه الإستمارة منشأ مسبقاً',
        ],

        'redirections' => [
            'create'        => 'خطأ في إنشاء قاعدة التوجيه',
            'update'        => 'خطأ في تعديل قاعدة التوجيه',
            'delete'        => 'خطأ في حذف قاعدة التوجيه',
            'already_exist' => ' يوجد قاعدة توجيه لهذا المسار منشأة مسبقاً',
        ],

        'posts' => [
            'create' => 'خطأ في إنشاء المقالة',
            'update' => 'خطأ في تعديل المقالة',
            'save'   => 'خطأ في حفظ المقالة',
            'delete' => 'خطأ في حذف المقالة',
        ],
    ],

    'frontend' => [
        'user' => [
            'email_taken'       => 'عنوان البريد المدخل موجود مسبقاً.',
            'password_mismatch' => 'لا يوجد تطابق مع كلمة المرور القديمة.',
            'delete_account'    => 'خطأ في حذف الحساب.',
            'updating_disabled' => 'تعديل معلومات الحساب غير مفعل.',
        ],

        'auth' => [
            'registration_disabled' => 'عملية التسجيل غير مفعلة.',
        ],
    ],
];
