<?php

return [
    'layout' => [
        'hello'               => 'مرحباً !',
        'regards'             => 'تحيات',
        'trouble'             => 'إذا واجهت أي مشكلة بالضغط على الزر :action، يرجى نسخ ولصق الرابط أدناه في المتصفح الخاص بك :',
        'all_rights_reserved' => 'جميع الحقوق محفوظة.',
    ],
    'password_reset' => [
        'subject' => 'إعادة تعيين كلمة المرور',
        'intro'   => 'تم إرسال هذا البريد الإلكتروني لأننا تلقينا طلب إعادة تعيين كلمة المرور للحساب الخاص بك',
        'action'  => 'إعادة تعيين كلمة المرور',
        'outro'   => 'إذا لم تطلب إعادة تعيين كلمة المرور، فلا داعي لاتخاذ أي إجراء',
    ],
    'email_confirmation' => [
        'subject' => 'تأكيد عنوان البريد الإلكتروني',
        'intro'   => 'تأكيد عنوان البريد الإلكتروني ضروري كي تقوم بتفعيل الحساب الخاص بك.',
        'action'  => 'تأكيد عنوان البريد الخاص بي',
        'outro'   => 'إن الحساب الخاص بك سيبقى محدوداً لطالما لم يتم تأكيد عنوان البريد الإلكتروني الخاص بك',
    ],
    'contact' => [
        'subject'     => 'رسالة إتصال جديدة',
        'new_contact' => 'لقد تلقيت رسالة إتصال جديدة. معلومات الإرسال :',
    ],
    'alert' => [
        'subject' => 'خطأ في [:app_name]',
        'message' => 'لقد واجهت خطأ غير متوقع من طرف الخادم بالرسالة التالية : :message.',
        'trace'   => 'تفاصيل التقفي :',
    ],
];
