<?php
/**
 * @author Andrey "Limych" Khrolenok <andrey@khrolenok.ru>
 */

return [
    'backend' => [
        'users' => [
            'created'        => 'Пользователь создан',
            'updated'        => 'Пользователь обновлён',
            'deleted'        => 'Пользователь удалён',
            'bulk_destroyed' => 'Выбранные пользователи удалены',
            'bulk_enabled'   => 'Выбранные пользователи активированы',
            'bulk_disabled'  => 'Выбранные пользователи заблокированы',
        ],

        'roles' => [
            'created' => 'Роль создана',
            'updated' => 'Роль обновлена',
            'deleted' => 'Роль удалена',
        ],

        'metas' => [
            'created'        => 'Метаданные созданы',
            'updated'        => 'Метаданные обновлены',
            'deleted'        => 'Метаданные удалены',
            'bulk_destroyed' => 'Выбранные метаданные удалены',
        ],

        'form_submissions' => [
            'deleted'        => 'Представление удалёно',
            'bulk_destroyed' => 'Выбранные представления удалены',
        ],

        'form_settings' => [
            'created' => 'Настройка формы создана',
            'updated' => 'Настройка формы обновлена',
            'deleted' => 'Настройка формы удалена',
        ],

        'redirections' => [
            'created'        => 'Перенаправление создано',
            'updated'        => 'Перенаправление обновлено',
            'deleted'        => 'Перенаправление удалено',
            'bulk_destroyed' => 'Выделенные перенаправления удалены',
            'bulk_enabled'   => 'Выделенные перенаправления включены',
            'bulk_disabled'  => 'Выделенные перенаправления отключены',
            'file_imported'  => 'Файл успешно импортирован',
        ],

        'posts' => [
            'created'        => 'Статья создана',
            'updated'        => 'Статья обновлена',
            'deleted'        => 'Статья удалена',
            'bulk_destroyed' => 'Выбранные статьи удалены',
            'bulk_published' => 'Выбранные статьи опубликованы',
            'bulk_pending'   => 'Выбранные статьи ожидают проверки',
            'bulk_pinned'    => 'Выбранные статьи закреплены',
            'bulk_promoted'  => 'Выбранные статьи выделены',
        ],

        'actions' => [
            'invalid' => 'Неверное действие',
        ],
    ],

    'frontend' => [
    ],
];
