<?php
/**
 * @author Andrey "Limych" Khrolenok <andrey@khrolenok.ru>
 */

return [
    'language'            => 'Язык',
    'actions'             => 'Действия',
    'general'             => 'Основные',
    'no_results'          => 'Нет доступных результатов',
    'search'              => 'Искать',
    'validate'            => 'Применить',
    'choose_file'         => 'Выберите файл',
    'no_file_chosen'      => 'Файл не выбран',
    'are_you_sure'        => 'Вы уверены?',
    'delete_image'        => 'Удалить изображение',
    'yes'                 => 'Да',
    'no'                  => 'Нет',
    'add_new'             => 'Добавить',
    'export'              => 'Экспорт',
    'more_info'           => 'Больше информации',
    'author'              => 'Автор',
    'author_id'           => 'ID автора',
    'last_access_at'      => 'Последний доступ',
    'published_at'        => 'Опубликовано',
    'created_at'          => 'Создано',
    'updated_at'          => 'Обновлено',
    'deleted_at'          => 'Удалено',
    'no_value'            => 'Нет значения',
    'upload_image'        => 'Загрузить изображение',
    'anonymous'           => 'Аноним',
    'all_rights_reserved' => 'Все права зарезервированы.',
    'with'                => 'с',
    'by'                  => '',

    'datatables' => [
        'no_results'         => 'Нет доступных результатов',
        'no_matched_results' => 'Не найдено подходящих результатов',
        'show_per_page'      => 'Показать',
        'entries_per_page'   => 'записей на страницу',
        'search'             => 'Искать',
        'infos'              => 'Показаны записи с :offset_start по :offset_end из :total',
    ],

    'morphs' => [
        'post' => 'Статья, ID :id',
        'user' => 'Пользователь, ID :id',
    ],

    'auth' => [
        'disabled' => 'Ваш аккаунт заблокирован.',
    ],

    'http' => [
        '403' => [
            'title'       => 'Доступ запрещён',
            'description' => 'Извините, но у вас нет прав доступа к этой странице.',
        ],
        '404' => [
            'title'       => 'Ресурс не найден',
            'description' => 'Извините, но этого ресурса не существует.',
        ],
        '500' => [
            'title'       => 'Ошибка сервера',
            'description' => 'Извините, но сервер столкнулся с ситуацией, которую он не может обработать. Мы исправим это как можно скорее.',
        ],
    ],

    'localization' => [
        'en' => 'Английский',
        'ru' => 'Русский',
        'fr' => 'Французский',
        'es' => 'Испанский',
        'de' => 'Немецкий',
        'zh' => 'Китайский',
        'ar' => 'Арабский',
        'pt' => 'Португальский',
    ],

    'placeholders' => [
        'route' => 'Выберите правильный внутренний маршрут',
        'tags'  => 'Выберите или создайте метку',
    ],

    'cookieconsent' => [
        'message' => 'На этом сайте используются файлы cookie, чтобы вам было комфортнее им пользоваться.',
        'dismiss' => 'Понятно!',
    ],

    'descriptions' => [
        'allowed_image_types' => 'Доступные типы: PNG GIF JPG JPEG.',
    ],

    'user' => [
        'dashboard'                 => 'Панель управления',
        'remember'                  => 'Запомнить',
        'login'                     => 'Вход',
        'logout'                    => 'Выход',
        'password_forgot'           => 'Забыли пароль?',
        'send_password_link'        => 'Отправить ссылку сброса пароля',
        'password_reset'            => 'Сброс пароля',
        'register'                  => 'Регистрация',
        'space'                     => 'Моё пространство',
        'settings'                  => 'Настройки',
        'account'                   => 'Мой аккаунт',
        'profile'                   => 'Мой профиль',
        'avatar'                    => 'Аватар',
        'online'                    => 'В&nbsp;сети',
        'edit_profile'              => 'Изменить мой профиль',
        'change_password'           => 'Изменить мой пароль',
        'delete'                    => 'Удалить мой аккаунт',
        'administration'            => 'Администрирование',
        'member_since'              => 'Участник с :date',
        'profile_updated'           => 'Профиль успешно изменён.',
        'password_updated'          => 'Пароль успешно изменён.',
        'super_admin'               => 'Супер-администратор',

        'account_delete'  => '<p>Это действие полностью удалит вашу учетную запись с этого сайта, а также все связанные данные.</p>',
        'account_deleted' => 'Аккаунт успешно удалён',

        'titles' => [
            'space'   => 'Моё пространство',
            'account' => 'Мой аккаунт',
        ],
    ],

    'alerts' => [
        'login_as'      => 'Вы вошли как <strong>:name</strong>, вы можете обратно войти как <a href=":route" data-turbolinks="false">:admin</a>.',
    ],

    'backend' => [
        'dashboard' => [
            'new_posts'            => 'Новые статьи',
            'pending_posts'        => 'Ожидающие одобрения статьи',
            'published_posts'      => 'Опубликованные статьи',
            'active_users'         => 'Активные пользователи',
            'form_submissions'     => 'Заполненные формы',
            'last_posts'           => 'Последние статьи',
            'last_published_posts' => 'Последние публикации',
            'last_pending_posts'   => 'Последние ожидающие статьи',
            'last_new_posts'       => 'Последние новые статьи',
            'all_posts'            => 'Все статьи',
        ],

        'new_menu' => [
            'post'         => 'Новая статья',
            'form_setting' => 'Новая форма',
            'user'         => 'Новый пользователь',
            'role'         => 'Новая роль',
            'meta'         => 'Новые метаданные',
            'redirection'  => 'Новое перенаправление',
        ],

        'sidebar' => [
            'content' => 'Управление содержимым',
            'forms'   => 'Управление формами',
            'access'  => 'Управление доступом',
            'seo'     => 'Настройки SEO',
        ],

        'titles' => [
            'dashboard' => 'Панель управления',
        ],

        'users' => [
            'titles' => [
                'main'   => 'Пользователи',
                'index'  => 'Список пользователей',
                'create' => 'Создание пользователя',
                'edit'   => 'Изменение пользователя',
            ],

            'actions' => [
                'destroy' => 'Удалить выбранных пользователей',
                'enable'  => 'Активировать выбранных пользователей',
                'disable' => 'Отключить выбранных пользователей',
            ],
        ],

        'roles' => [
            'titles' => [
                'main'   => 'Роли',
                'index'  => 'Список ролей',
                'create' => 'Создание роли',
                'edit'   => 'Изменение роли',
            ],
        ],

        'metas' => [
            'titles' => [
                'main'   => 'Метаданные',
                'index'  => 'Список метаданных',
                'create' => 'Создание метаданных',
                'edit'   => 'Изменение метаданных',
            ],

            'actions' => [
                'destroy' => 'Удалить выбранные метаданные',
            ],
        ],

        'form_submissions' => [
            'titles' => [
                'main'  => 'Заполнения',
                'index' => 'Список заполнений форм',
                'show'  => 'Детали заполнения формы',
            ],

            'actions' => [
                'destroy' => 'Удалить выбранные заполнения',
            ],
        ],

        'form_settings' => [
            'titles' => [
                'main'   => 'Формы',
                'index'  => 'Список форм',
                'create' => 'Создание формы',
                'edit'   => 'Изменение формы',
            ],

            'descriptions' => [
                'recipients' => 'Пример: \'webmaster@example.com\' или \'sales@example.com,support@example.com\'. Для указания нескольких получателей перечислите адреса через запятую.',
                'message'    => 'Сообщение для показа пользователю после отправки формы. Оставьте пустым, если ничего не надо показывать.',
            ],
        ],

        'redirections' => [
            'titles' => [
                'main'   => 'Перенаправления',
                'index'  => 'Список перенаправлений',
                'create' => 'Создание перенаправления',
                'edit'   => 'Изменение перенаправления',
            ],

            'actions' => [
                'destroy' => 'Удалить выбранные перенаправления',
                'enable'  => 'Активировать выбранные перенаправления',
                'disable' => 'Отключить выбранные перенаправления',
            ],

            'types' => [
                'permanent' => 'Постоянное перенаправление (301)',
                'temporary' => 'Временное перенаправление (302)',
            ],

            'import' => [
                'title'       => 'Импорт CSV-файла',
                'label'       => 'Выберите CSV-файл для импорта',
                'description' => 'Файл должен содержать две колонки с заголовками «source» (исходный) и «target» (целевой), перенаправления будут постоянные по-умолчанию.',
            ],
        ],

        'posts' => [
            'statuses' => [
                'draft'     => 'Черновик',
                'pending'   => 'Ожидающее',
                'published' => 'Опубликованное',
            ],

            'titles' => [
                'main'        => 'Статьи',
                'index'       => 'Список статей',
                'create'      => 'Создать статью',
                'edit'        => 'Редактировать статью',
                'publication' => 'Параметры публикации',
            ],

            'descriptions' => [
                'meta_title'       => 'Если оставить пустым, по-умолчанию будет заголовком статьи.',
                'meta_description' => 'Если оставить пустым, по умолчанию будет отображаться резюме статьи.',
            ],

            'placeholders' => [
                'body'             => 'Напишите своё содержимое...',
                'meta_title'       => 'Заголовок статьи',
                'meta_description' => 'Резюме статьи',
            ],

            'actions' => [
                'destroy' => 'Удалить выбранные статьи',
                'publish' => 'Опубликовать выбранные статьи',
                'pin'     => 'Закрепить выбранные статьи',
                'promote' => 'Выделить выбранные статьи',
            ],
        ],
    ],

    'frontend' => [
        'titles' => [
            'home'           => 'Начало',
            'about'          => 'О нас',
            'contact'        => 'Контакты',
            'blog'           => 'Блог',
            'message_sent'   => 'Сообщение отправлено',
            'legal_mentions' => 'Юридическая информация',
            'administration' => 'Администрирование',
        ],

        'submissions' => [
            'message_sent' => '<p>Ваше сообщение успешно отправлено.</p>',
        ],

        'placeholders' => [
            'locale'   => 'Выберите свой язык',
            'timezone' => 'Выберите свой часовой пояс',
        ],

        'blog' => [
            'published_at'                     => 'Опубликовано :date',
            'published_at_with_owner_linkable' => 'Опубликовано <a href=":link">:name</a>, :date',
            'tags'                             => 'Метки',
        ],
    ],
];
