<?php
/**
 * @author Andrey "Limych" Khrolenok <andrey@khrolenok.ru>
 */

return [
    'layout' => [
        'hello'               => 'Здравствуйте!',
        'regards'             => 'С уважением',
        'trouble'             => 'Если у вас не получается воспользоваться кнопкой :action, скопируйте URL ниже и откройте его в удобном вам браузере:',
        'all_rights_reserved' => 'Все права зарезервированы.',
    ],
    'password_reset' => [
        'subject' => 'Сброс пароля',
        'intro'   => 'Вам отправлено это письмо, потому что мы получили запрос на сброс пароля для вашей учетной записи.',
        'action'  => 'Сбросить пароль',
        'outro'   => 'Если вы не запрашивали сброс пароля, просто проигнорируйте это письмо.',
    ],
    'contact' => [
        'subject'     => 'Новое сообщение с сайта',
        'new_contact' => 'Получено новое сообщение с сайта:',
    ],
    'alert' => [
        'subject' => '[:app_name] Ошибка приложения',
        'message' => 'На сервере произошёл сбой со следующим сообщением об ошибке: :message',
        'trace'   => 'Детали трассировки:',
    ],
];
