<?php
/**
 * @author Andrey "Limych" Khrolenok <andrey@khrolenok.ru>
 */

return [
    /*
    |--------------------------------------------------------------------------
    | Сообщения при постраничном выводе
    |--------------------------------------------------------------------------
    |
    | Следующие строки используются библиотекой постраничного выода данных
    | для создания простых ссылок на страницы. Вы можете изменить их на всё,
    | что хотите, чтобы настроить свои представления, чтобы они соответствовали
    | вашему приложению.
    |
    */

    'previous' => '&laquo;&nbsp;Назад',
    'next'     => 'Вперёд&nbsp;&raquo;',
];
