<?php
/**
 * @author Andrey "Limych" Khrolenok <andrey@khrolenok.ru>
 */

return [
    /*
    |--------------------------------------------------------------------------
    | Сообщения при сбросе пароля
    |--------------------------------------------------------------------------
    |
    | Следующие строки являются строками по умолчанию, которые соответствуют
    | ошибкам, возвращаемым брокером паролей при попытке обновления пароля.
    | Например, для недопустимого токена или неверного нового пароля.
    |
    */

    'password' => 'Пароль должен быть как минимум 6 символов длиной и совпадать с подтверждением.',
    'reset'    => 'Ваш пароль изменён!',
    'sent'     => 'Мы отправили вам на почту ссылку для сброса пароля!',
    'token'    => 'Неверный токен сброса пароля.',
    'user'     => 'У нас нет пользователя с таким адресом электронной почты.',
];
